nxp-mcuxpresso/mcux-soc-svd/MCXW70AA/MCXW70AA.xml
        <register>
          <name>OCMDR2</name>
          <description>On-Chip Memory Descriptor Register</description>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xE7041000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OCMPU</name>
              <description>OCMPU</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OCMT</name>
              <description>OCMT</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>sysram</name>
                  <description>OCMEMn is a System RAM.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rom</name>
                  <description>OCMEMn is a ROM.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>flash</name>
                  <description>OCMEMn is a Program Flash.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCMW</name>
              <description>OCMW</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bit32</name>
                  <description>OCMEMn 32-bits wide</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bit64</name>
                  <description>OCMEMn 64-bits wide</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bit128</name>
                  <description>OCMEMn 128-bits wide</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bit256</name>
                  <description>OCMEMn 256-bits wide</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCMSZ</name>
              <description>OCMSZ</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>no OCMEMn</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size1kb</name>
                  <description>1KB OCMEMn</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size2kb</name>
                  <description>2KB OCMEMn</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size4kb</name>
                  <description>4KB OCMEMn</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size8kb</name>
                  <description>8KB OCMEMn</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size16kb</name>
                  <description>16KB OCMEMn</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size32k</name>
                  <description>32KB OCMEMn</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size64kb</name>
                  <description>64KB OCMEMn</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size128kb</name>
                  <description>128KB OCMEMn</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size256kb</name>
                  <description>256KB OCMEMn</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size512kb</name>
                  <description>512KB OCMEMn</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size1mb</name>
                  <description>1MB OCMEMn</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size2mb</name>
                  <description>2MB OCMEMn</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size4mb</name>
                  <description>4MB OCMEMn</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size8mb</name>
                  <description>20KB OCMEMn</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size16mb</name>
                  <description>320KB OCMEMn</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCMSZH</name>
              <description>OCMSZH</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>powerof2</name>
                  <description>OCMEMn is a power-of-2 capacity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nonpowerof2</name>
                  <description>OCMEMn is not a power-of-2, with a capacity is 0.75 * OCMSZ.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCMECC</name>
              <description>OCMECC</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>exclude</name>
                  <description>OCMEMn does not have ECC support.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>include</name>
                  <description>OCMEMn has ECC support.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>V</name>
              <description>V</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>exclude</name>
                  <description>OCMEMn is not present.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>include</name>
                  <description>OCMEMn is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OCMDR3</name>
          <description>On-Chip Memory Descriptor Register</description>
          <addressOffset>0x40C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xC7041000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OCMPU</name>
              <description>OCMPU</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OCMT</name>
              <description>OCMT</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>sysram</name>
                  <description>OCMEMn is a System RAM.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rom</name>
                  <description>OCMEMn is a ROM.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>flash</name>
                  <description>OCMEMn is a Program Flash.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCMW</name>
              <description>OCMW</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bit32</name>
                  <description>OCMEMn 32-bits wide</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bit64</name>
                  <description>OCMEMn 64-bits wide</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bit128</name>
                  <description>OCMEMn 128-bits wide</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bit256</name>
                  <description>OCMEMn 256-bits wide</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCMSZ</name>
              <description>OCMSZ</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>no OCMEMn</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size1kb</name>
                  <description>1KB OCMEMn</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size2kb</name>
                  <description>2KB OCMEMn</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size4kb</name>
                  <description>4KB OCMEMn</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size8kb</name>
                  <description>8KB OCMEMn</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size16kb</name>
                  <description>16KB OCMEMn</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size32k</name>
                  <description>32KB OCMEMn</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size64kb</name>
                  <description>64KB OCMEMn</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size128kb</name>
                  <description>128KB OCMEMn</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size256kb</name>
                  <description>256KB OCMEMn</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size512kb</name>
                  <description>512KB OCMEMn</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size1mb</name>
                  <description>1MB OCMEMn</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size2mb</name>
                  <description>2MB OCMEMn</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size4mb</name>
                  <description>4MB OCMEMn</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size8mb</name>
                  <description>20KB OCMEMn</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size16mb</name>
                  <description>320KB OCMEMn</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCMSZH</name>
              <description>OCMSZH</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>powerof2</name>
                  <description>OCMEMn is a power-of-2 capacity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nonpowerof2</name>
                  <description>OCMEMn is not a power-of-2, with a capacity is 0.75 * OCMSZ.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCMECC</name>
              <description>OCMECC</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>exclude</name>
                  <description>OCMEMn does not have ECC support.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>include</name>
                  <description>OCMEMn has ECC support.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>V</name>
              <description>V</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>exclude</name>
                  <description>OCMEMn is not present.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>include</name>
                  <description>OCMEMn is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
