nxp-mcuxpresso/mcux-soc-svd/MCXW70AA/MCXW70AA.xml
        <register>
          <name>MACSHORTADDRS1</name>
          <description>MAC SHORT ADDRESS FOR PAN1 (MACSHORTADDRS1)The MACSHORTADDRS1 register .</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MACPANID1</name>
              <description>MAC PAN ID for PAN1 MAC PAN ID for PAN1. The packet processor compares the incoming packet's Destination PAN ID against the contents of this register to determine if the packet is addressed to this device; or if the incoming packet is a Beacon frame, the packet processor compares the incoming packet Source PAN ID against this register. Also, if PANCORDNTR1=1, and the incoming packet has no Destination Address field, and if the incoming packet is a Data or MAC Command frame, the packet processor compares the incoming packet Source PAN ID against this register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MACSHORTADDRS1</name>
              <description>MAC SHORT ADDRESS for PAN1 MAC Short Address for PAN1, for 16-bit destination addressing mode. The packet processor compares the incoming packet's Destination Address against the contents of this register to determine if the packet is addressed to this device.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACLONGADDRS1_LSB</name>
          <description>MAC LONG ADDRESS 1 LSB (MACLONGADDRS1_LSB)MAC Long Address for PAN1</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MACLONGADDRS1_LSB</name>
              <description>MAC LONG ADDRESS for PAN1 LSB MAC Long Address for PAN1, for 64-bit destination addressing mode. The packet processor compares the incoming packet's Destination Address against the contents of this register to determine if the packet is addressed to this device.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACLONGADDRS1_MSB</name>
          <description>MAC LONG ADDRESS 1 MSB (MACLONGADDRS1_MSB)MAC Long Address for PAN1</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MACLONGADDRS1_MSB</name>
              <description>MAC LONG ADDRESS for PAN1 MSB MAC Long Address for PAN1, for 64-bit destination addressing mode. The packet processor compares the incoming packet's Destination Address against the contents of this register to determine if the packet is addressed to this device.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DUAL_PAN_CTRL</name>
          <description>DUAL PAN CONTROL (DUAL_PAN_CTRL)Dual PAN Control Register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACTIVE_NETWORK</name>
              <description>Active Network Selector Selects the PAN on which to transceive, by activating a PAN parameter set (PAN0 or PAN1). In Manual Dual PAN mode (or Single PAN mode), this bit selects the active PAN parameter set (channel and addressing parameters) which governs all autosequences. In Auto Dual PAN mode, this bit selects the PAN on which to begin transceiving, latched at the point at which DUAL_PAN_DWELL register is written. 0x0,Select PAN0, 0x1,Select PAN1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUAL_PAN_AUTO</name>
              <description>Activates automatic Dual PAN operating mode Activates automatic Dual PAN operating mode. In this mode, PAN-switching is controlled by hardware at a pre-programmed rate, determined by DUAL_PAN_DWELL. 0: Manual Dual PAN mode (or Single PAN mode). 1: Auto Dual PAN Mode Whenever DUAL_PAN_AUTO=0, CURRENT_NETWORK=ACTIVE_NETWORK at all times. In other words, software directly controls which PAN is selected. Whenever DUAL_PAN_AUTO=1, CURRENT_NETWORK is controlled by hardware.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CURRENT_NETWORK</name>
              <description>Indicates which PAN is currently selected by hardware This read-only bit indicates which PAN is currently selected by hardware in automatic Dual PAN mode 0x0,PAN0 is selected, 0x1,PAN1 is selected</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ZB_DP_CHAN_OVRD_EN</name>
              <description>Dual PAN Channel Override Enable In Dual PAN mode, in case there is a need to generate a frequency which may be offset from the 16 prescribed 5MHz-spaced channels, to, for example, avoid interference on one of the Dual PAN channels, a method has been provided to accomplish that, by designating one of the two PAN channels to use the transceiver's set of direct frequency-programming registers, instead of CHANNEL_NUMx. Programming the direct frequency-programming registers -- integer, numerator, and denominator, allows an RF frequency to be selected with much more precision than the 5MHz granularity of the Zigbee mapped-channel registers, CHANNEL_NUM0 and CHANNEL_NUM1. Two bits have been provided in 802.15.4 space to realize this feature: ZB_DP_CHAN_OVRD_SEL and ZB_DP_CHAN_OVRD_EN. When ZB_DP_CHAN_OVRD_EN=1, this enables one of the Dual PAN channels to use the direct frequency programming. The ZB_DP_CHAN_OVRD_SEL bit determines which channel uses the direct programming, according to the following: If ZB_DP_CHAN_OVRD_EN=0, then PAN0 frequency is determined by register CHANNEL_NUM0[6:0] and PAN1 frequency is determined by register CHANNEL_NUM1[6:0]. If ZB_DP_CHAN_OVRD_EN=1 and ZB_DP_CHAN_OVRD_SEL=0, then PAN0 frequency is determined by DIRECT FREQUENCY PROGRAMMING and PAN1 frequency is determined by register CHANNEL_NUM1[6:0]. If ZB_DP_CHAN_OVRD_EN=1 and ZB_DP_CHAN_OVRD_SEL=1, then PAN0 frequency is determined by register CHANNEL_NUM0[6:0] and PAN1 frequency is determined by DIRECT FREQUENCY PROGRAMMING. Direct Frequency Programming is accomplished by setting the PLL's Integer, Numerator, and Denominator registers to the appropriate values for the desired RF frequency.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ZB_DP_CHAN_OVRD_SEL</name>
              <description>Dual PAN Channel Override Selector This bit works with ZB_DP_CHAN_OVRD_EN to allow one of the two Dual PAN channels to use Direct Frequency programming. See description for ZB_DP_CHAN_OVRD_EN .</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECYC_IMMEDIATE_PPME</name>
              <description>RECYCLE trigger timing for Filterfail_codes generated by PPME 1'b0: trigger transition to RECYCLE at the end of the packet reception (default) 1'b1: trigger RECYCLE immediately</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECYC_IMMEDIATE_PP</name>
              <description>RECYCLE trigger timing for Filterfail_codes generated by packet_processor 1'b0: trigger transition to RECYCLE at the end of the packet reception (default) 1'b1: trigger RECYCLE immediately</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUAL_PAN_DWELL</name>
              <description>Dual PAN Channel Frequency Dwell Time Channel Frequency Dwell Time. In Auto Dual PAN mode, hardware will toggle the PAN, after dwelling on the current PAN for the interval described below (assuming Preamble/SFD not detected). A write to DUAL_PAN_DWELL, always re-initializes the DWELL TIMER to the programmed value. If a write to DUAL_PAN_DWELL occurs during an autosequence, the DWELL TIMER will begin counting down immediately. If a write to DUAL_PAN_DWELL occurs when there is no autosequence underway, the DWELL TIMER will not begin counting until the next autosequence begins; it will begin counting at the start of the sequence warmup. DUAL_PAN_DWELL[1:0] select the timebase for the dwell time. There are 4 options: DUAL_PAN_DWELL[1:0]=0b00 --&gt; TIMEBASE=0.5ms DUAL_PAN_DWELL[1:0]=0b01 --&gt; TIMEBASE=2.5ms DUAL_PAN_DWELL[1:0]=0b10 --&gt; TIMEBASE=10ms DUAL_PAN_DWELL[1:0]=0b11 --&gt; TIMEBASE=50ms DUAL_PAN_DWELL[7:2] select how many multiples of the time base to use, from 1 (DUAL_PAN_DWELL[7:2]=0) to 64 (DUAL_PAN_DWELL[7:2]=63). Given those definitions, the table below specifies the minimum and maximum dwell times for each TIMEBASE option: DUAL_PAN_DWELL[1:0]=0b00 --&gt; MIN_DWELL=0.5ms MAX_DWELL=32ms DUAL_PAN_DWELL[1:0]=0b01 --&gt; MIN_DWELL=2.5ms MAX_DWELL=160ms DUAL_PAN_DWELL[1:0]=0b10 --&gt; MIN_DWELL=10ms MAX_DWELL=640ms DUAL_PAN_DWELL[1:0]=0b11 --&gt; MIN_DWELL=50ms MAX_DWELL=3.2seconds A write to DUAL_PAN_DWELL also causes the value of ACTIVE_NETWORK to get latched into the hardware. This latched value will be the starting point for the automatic dual-pan mode (i.e., start on PAN0 or on PAN1). The starting value takes effect immediately (if sequence is underway and DUAL_PAN_AUTO=1), or is otherwise delayed until sequence starts and DUAL_PAN_AUTO=1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUAL_PAN_REMAIN</name>
              <description>Time Remaining before next PAN switch in auto Dual PAN mode This read-only register indicates time remaining before next PAN switch in auto Dual PAN mode. The units for this register, depend on the PRESCALER setting (bits [1:0]) in the DUAL_PAN_DWELL register. Tthe units are the same as the TIMEBASE determined by the prescaler, as per the following table: DUAL_PAN_DWELL[1:0]=0b00 (TIMEBASE=0.5ms) DUAL_PAN_REMAIN UNITS=0.5ms DUAL_PAN_DWELL[1:0]=0b01 (TIMEBASE=2.5ms) DUAL_PAN_REMAIN UNITS=2.5ms DUAL_PAN_DWELL[1:0]=0b10 (TIMEBASE=10ms) DUAL_PAN_REMAIN UNITS=10ms DUAL_PAN_DWELL[1:0]=0b11 (TIMEBASE=50ms) DUAL_PAN_REMAIN UNITS=50ms The readback value indicates that between N-1 and N timebase units remain until the next PAN switch. For example, a DUAL_PAN_REMAIN readback value of 3, with a DUAL_PAN_DWELL PRESCALER setting of 2 (10ms), indicates that between 20ms (2*10ms) and 30ms (3*10ms), remain until the next automatic PAN switch.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECD_ON_PAN0</name>
              <description>Last Packet was Received on PAN0 Indicates the packet which was just received, was received on PAN0. In Dual PAN mode operating on 2 different channels, RECD_ON_PAN0 will be set if CURRENT_NETWORK=0 when the packet was received, regardless of FILTERFAIL status. In DUAL PAN mode operating with same channel on both networks, CURRENT_NETWORK will be ignored and RECD_ON_PAN0 will be set only if a valid packet was received on PAN0 (PAN0's FILTERFAIL_FLAG is deasserted). RECD_ON_PAN0 remains valid until the start of the next autoseqeuence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECD_ON_PAN1</name>
              <description>Last Packet was Received on PAN1 Indicates the packet which was just received, was received on PAN1. In Dual PAN mode operating on 2 different channels, RECD_ON_PAN1 will be set if CURRENT_NETWORK=1 when the packet was received, regardless of FILTERFAIL status. In DUAL PAN mode operating with same channel on both networks, CURRENT_NETWORK will be ignored and RECD_ON_PAN1 will be set only if a valid packet was received on PAN1 (PAN1's FILTERFAIL_FLAG is deasserted). RECD_ON_PAN1 remains valid until the start of the next autoseqeuence.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECD_ON_PAN0_EARLY</name>
              <description>Current packet is Received on PAN0, early indication. The early indication is evaluated when packet_processor or PPME have finished the addresses and/or PANId matching check on the incomming packet. The status of RECD_ON_PAN0_EARLY is valid if RECD_ON_PAN_EARLY_STS = 1'b1. Indicates the packet which was just received, was received on PAN0. In Dual PAN mode operating on 2 different channels, RECD_ON_PAN0_EARLY will be set if CURRENT_NETWORK=0 when the address or PANId matching was processed, regardless of FILTERFAIL status. In DUAL PAN mode operating with same channel on both networks, CURRENT_NETWORK will be ignored and RECD_ON_PAN0_EARLY will be set only if a valid packet was received on PAN0 (PAN0's FILTERFAIL_FLAG is deasserted). RECD_ON_PAN0_EARLY remains valid until the start of the next autoseqeuence.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECD_ON_PAN1_EARLY</name>
              <description>Current packet is Received on PAN1, early indication. The early indication is evaluated when packet_processor or PPME have finished the addresses and/or PANId matching check on the incomming packet. The status of RECD_ON_PAN1_EARLY is valid if RECD_ON_PAN_EARLY_STS = 1'b1. Indicates the packet which was just received, was received on PAN1. In Dual PAN mode operating on 2 different channels, RECD_ON_PAN1_EARLY will be set if CURRENT_NETWORK=0 when the address or PANId matching was processed, regardless of FILTERFAIL status. In DUAL PAN mode operating with same channel on both networks, CURRENT_NETWORK will be ignored and RECD_ON_PAN1_EARLY will be set only if a valid packet was received on PAN1 (PAN1's FILTERFAIL_FLAG is deasserted). RECD_ON_PAN1_EARLY remains valid until the start of the next autoseqeuence.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECD_ON_PAN_EARLY_STS</name>
              <description>Status flag. Indicates that for the current packet address and PANId checks are processed and that RECD_ON_PAN0_EARLY and RECD_ON_PAN1_EARLY have been evaluated and valid. For packet types that are supported for the second stage of packet filtering of the packet_processor - which includes matching checks on Address and PANId fields of the Packet header - this is at the end of receiving the packet header fields. For packet-types for which the packet_processor does not support the address and PanID fiels checks, PPME can be used for &quot;second stage&quot; filtering. For those PP-unsupported packets, the RECD_ON_PAN_EARLY status is set if PPME filtering has been processed, i.e as soon as the matching process has finished (either resulting in a match or no-match indication).</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHANNEL_NUM1</name>
          <description>CHANNEL NUMBER 1 (CHANNEL_NUM1)</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHANNEL_NUM1</name>
              <description>Channel Number for PAN1 This is the mapped channel number used to transmit and receive Zigbee packets. This register applies to PAN1 only. CHANNEL_NUM1 should be in the range: 11 &lt;= CHANNEL_NUM1 &lt;= 26 Note : This register should not be programmed, and left in its default state, if Dual PAN mode is not in use.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEMP_MACSHORTADDRS1</name>
              <description>TEMPORARY MAC SHORT ADDRESS for PAN1 DURING TRANSITION FROM CHILD TO PARENT AND VICE-VERSA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEMP_SHORTADDRS_EN1</name>
              <description>When asserted Packet Processor will accept the packets with MACSHORTADDRS1 and TEMP_MACSHORTADDRS1 during transition of the device. When de-asserted Packet Processor will accept only the packets with MACSHORTADDRS1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAM_CTRL</name>
          <description>SAM CONTROL (SAM_CTRL)Source Address Management Control Register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SAP0_EN</name>
              <description>Enables SAP0 Partition of the SAM Table 0x0,Disables SAP0 Partition, 0x1,Enables SAP0 Partition</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAA0_EN</name>
              <description>Enables SAA0 Partition of the SAM Table 0x0,Disables SAA0 Partition, 0x1,Enables SAA0 Partition</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAP1_EN</name>
              <description>Enables SAP1 Partition of the SAM Table 0x0,Disables SAP1 Partition, 0x1,Enables SAP1 Partition</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAA1_EN</name>
              <description>Enables SAA1 Partition of the SAM Table 0x0,Disables SAA1 Partition, 0x1,Enables SAA1 Partition</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_FV1_DATA_PKT_IND</name>
              <description>Enables HW Frame Pending calculation for Frame Version 1 Data Packets for PAN0 0x0,Disables HW Frame Pending calculation for Frame Version 1 Data Packet, 0x1,Enables HW Frame Pending calculation for Frame Version 1 Data Packet</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FV1_DATA_PKT_IND</name>
              <description>Data Packet Indication for Frame Version 1 packet (valid only when ENABLE_FV1_DATA_PKT_IND is set) 0x0,Data Packet Indication not received, 0x1,Data Packet Indication received</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE_FV1_DATA_PKT_IND_PAN1</name>
              <description>Enables HW Frame Pending calculation for Frame Version 1 Data Packets for PAN1 0x0,Disables HW Frame Pending calculation for Frame Version 1 Data Packet, 0x1,Enables HW Frame Pending calculation for Frame Version 1 Data Packet</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAA0_START</name>
              <description>First Index of SAA0 partition The reset value is 0x40 for SAM size = 128 The reset value is 0x80 for SAM size = 256</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAP1_START</name>
              <description>First Index of SAP1 partition</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAA1_START</name>
              <description>First Index of SAA1 partition</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
