nxp-mcuxpresso/mcux-soc-svd/MCXW70AA/MCXW70AA.xml
        <register>
          <name>COEX_CTRL</name>
          <description>COEXISTENCE CONTROL (COEX_CTRL)Coexistence Control Registers in Link Layer.This Register provides various control bits for Coexistence funciton. It contains the bits to enable the Coexistence funciton. Also contains Coexistence Timeout Interrupt, Coexistence Timeout Interrupt Mask bit and some other COEX bits</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x304</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COEX_EN</name>
              <description>Coexistence Enable 0x0,Coexistence function is disabled., 0x1,Coexistence function is enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COEX_REQ_DELAY_EN</name>
              <description>Coexistence Request Delay Enable 0x0,arb_request is not delayed during R sequence., 0x1,arb_request is delayed until preamble is detected during R sequence.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COEX_REQ_ON_PD</name>
              <description>Coexistence Request on Preamble detected 0x0,arb_request is delayed until SFD is detected during R sequence., 0x1,arb_request is delayed until preamble is detected during R sequence.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COEX_TIMEOUT_MSK</name>
              <description>Coexistence Timeout Interrupt Mask bit 0x0,allows interrupt when coexistence timeout, 0x1,Interrupt generation is disabled, but a COEX_TIMEOUT_IRQ flag can be set</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COEX_TIMEOUT_IRQ</name>
              <description>Coexistence Timeout Interrupt Indicates coexistence timeout occurs. This is write '1' to clear bit.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>COEX_TIMEOUT</name>
              <description>Coexistence timeout value After arb_request asserts, arb_grant should assert before the timeout value. Otherwise the sequence is abort and COEX_TIMEOUT_IRQ bit is set. The step of the timeout value is 32us.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COEX_PRIORITY</name>
          <description>COEXISTENCE PRIORITY (COEX_PRIORITY)Programmable 2-bit priority for each RX or TX state in each ZSM.</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRIORITY_T</name>
              <description>PRIORITY_T PRIORITY value for TX Packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_R_PRE</name>
              <description>PRIORITY_R_PRE PRIORITY value of searching Preamble for RX Packet.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_R_PKT</name>
              <description>PRIORITY_R_PKT PRIORITY value for RX Packet.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_TACK</name>
              <description>PRIORITY_TACK PRIORITY value for TX ACK Packet.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_CCA</name>
              <description>PRIORITY_CCA PRIORITY value for CCA.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_CCCA</name>
              <description>PRIORITY_CCCA PRIORITY value for Continuous CCA.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_CTX</name>
              <description>PRIORITY_CT PRIORITY value for CCA before TX Packet.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_RACK_PRE</name>
              <description>PRIORITY_RACK_PRE PRIORITY value during searching preamble of ACK packet.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_RACK_PKT</name>
              <description>PRIORITY_RACK_PKT PRIORITY value during receiving ACK packet.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_OVRD</name>
              <description>PRIORITY_OVRD When PRIORITY_OVRD_EN is set to 1, PRIORITY_OVRD is used to override PRIORITY value.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_OVRD_EN</name>
              <description>PRIORITY_OVRD_EN Enable/Disable overriding PRIORITY value. 0x0,Disable overriding PRIORITY value., 0x1,Enable overriding PRIORITY value.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENHACK_CTRL0</name>
          <description>ENHACK_CTRL 0 (ENHACK_CTRL0)Control Register 0 for Enhanced Acknowledgment Feature</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENHACK_EN</name>
              <description>Enhanced Acknowledgment Enable 0x0,Enhanced acknowledgment is disabled., 0x1,Enhanced acknowledgment is enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_LEN_RDY</name>
              <description>Software enhanced acknowledgment frame Length field ready 0x0,Software enhanced acknowledgment frame Length field is not ready., 0x1,Software enhanced acknowledgment frame Length field is ready in RAM</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_HIE_RDY</name>
              <description>Software enhanced acknowledgment frame HIE field ready 0x0,Software enhanced acknowledgment frame HIE field is not ready., 0x1,Software enhanced acknowledgment frame HIE field is ready in RAM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMPTY_SECURITY_ENABLED_OVRD</name>
              <description>Override value of Security Enabled field in Empty Enhanced Acknowledgment</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMPTY_SRC_ADDR_MODE</name>
              <description>Source Address Mode field in Empty Enhanced Acknowledgment</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_MHR_LENGTH</name>
              <description>Software calculated MHR(excludes the HIE field) Length in bytes.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HW_FRAME_PENDING</name>
              <description>Hardware calculated Frame Pending field When received a DATA or Command Frame, hardware calculates the Frame Pending field by Source Address Management. This bit can be used by software to build the Enhanced Acknowledgment frame.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EMPTY_SECURITY_ENABLED_OVRD_EN</name>
              <description>Override enable of Security Enabled field in Empty Enhanced Acknowledgment 0x0,Security Enabled field in Empty Enhanced Acknowledgment frame is 0., 0x1,Security Enabled field in Empty Enhanced Acknowledgment frame is, from EMPTY_SECURITY_ENABLED_OVRD.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_HW_MODE7_8</name>
              <description>Enable AUTOACK for frame version 2 extended addressing modes 0x0,Disable autack for frame version 2 extended addressing modes, 0x1,Enable AUTOACK for frame version 2extended addressing modes</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ACK_ENABLE_FOR_FV2</name>
              <description>Force AUTOACK for all frame version 2 packets, PAN0 0x0,Normal operation, 0x1,Force AUTOACK for all frame version2 packets</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ACK_ENABLE_FOR_FV2_PAN1</name>
              <description>Force AUTOACK for all frame version 2 packets, PAN1 0x0,Normal operation, 0x1,Force AUTOACK for all frame version2 packets</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACK_ABORT_MSK</name>
              <description>Enhanced Acknowledgment Abort IRQ Mask bit 0x0,allows interrupt when HIE field is not ready by software., 0x1,Interrupt generation is disabled, but a ACK_ABORT_IRQ flag can be set</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACK_ABORT_IRQ</name>
              <description>Enhanced Acknowledgment Abort IRQ This interrupt status bit indicates the HIE field is not ready by software.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>EMPTY_ACK_MSK</name>
              <description>Empty Enhanced Acknowledgment IRQ Mask bit 0x0,allows interrupt when Empty Enhanced Acknowledgment, 0x1,Interrupt generation is disabled, but a EMPTY_ACK_IRQ flag can be set</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMPTY_ACK_IRQ</name>
              <description>Empty Enhanced Acknowledgment IRQ This interrupt status bit indicates the Empty Enhanced Acknowledgment is to be sent.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RECYC_MSK</name>
              <description>Recycle IRQ Mask bit 0x0,allows interrupt when recycle, 0x1,Interrupt generation is disabled, but a RECYC_IRQ flag can be set</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECYC_IRQ</name>
              <description>Recycle IRQ This interrupt status bit indicates the hardware recycle on filter fail or CRC invalid.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CG_OVRD</name>
          <description>Clock Gating Override Register (CG_OVRD)</description>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AHB_HCLK_GATED_OVRD</name>
              <description>Zigbee AHB clock enable override (default = 0 ) If set 1'b1, the AHB hclk is always enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPS_CLK_EN_OVRD</name>
              <description>IPS clock enable override (default =0), if set 1'b1 the CFG clock of the ahb_slave is always enabled</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAME_CH_BOTH_SAM_LKUP_EM</name>
              <description>Enable look-up for both PAN0 and PAN1 SAM table for same channel scenario</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ZIGREG_CKEN_FW_OV</name>
              <description>AHB clock (hclk) enable override (default = 0 ) If set 1'b1, the AHB hclk is always enabled</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROG_PKT_FLTR_LO_PATT_A</name>
          <description>no description available</description>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKT_FLTR_LO_PATT_A</name>
              <description>PPME filter A: 32bit LSB Rx Pattern programmed by software to be matched with the subfield of the incoming Rx Packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROG_PKT_FLTR_UP_PATT_A</name>
          <description>no description available</description>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKT_FLTR_UP_PATT_A</name>
              <description>PPME filter A: 32bit MSB Rx Pattern programmed by software to be matched with the subfield of the incoming Rx Packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROG_PKT_FLTR_LO_MSK_A</name>
          <description>no description available</description>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKT_FLTR_LO_MSK_A</name>
              <description>PPME filter A: To mask off the bits not required to be compared between PKT_FLTR_LO_PATT_A and Rx packet buffer mask bit = 1 means &quot;no compare&quot; mask-bit = 0 means &quot;do compare&quot;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROG_PKT_FLTR_UP_MSK_A</name>
          <description>no description available</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKT_FLTR_UP_MSK_A</name>
              <description>PPME filter A: To mask off the bits not required to be compared between PKT_FLTR_UP_PATT_A and Rx packet buffer mask bit = 1 means &quot;no compare&quot; mask-bit = 0 means &quot;do compare&quot;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROG_PKT_FLTR_CTRL_A</name>
          <description>no description available</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKT_FLTR_OFST_A</name>
              <description>PPME_A: Offset to skip pattern match for any number of bytes between 0 to 127th byte of the packet buffer for pkt_fltr_patt_a</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKT_FLTR_EN_A</name>
              <description>PPME_A: Set to enable packet filter for pkt_fltr_patt_a</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKT_FLTR_REJECT_PKT_A</name>
              <description>PPME_A: Enable to abort the current packet. Disable to generate FILTERFAIL_IRQ interrupt and continue reception of the current packet.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKT_FLTR_MAT_IRQ_MODE_A</name>
              <description>PPME_A: Disabled (1'b0) - There will be no patt_mat_irq_a generated in real time if pkt_fltr_patt_a matches and if there is No CRC failure. At the end of the receive only RXIRQ will be generated to signify the end of the packet. Enabled (1'b1) - interrupt patt_mat_irq_a will be generated in the real time.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKT_FLTR_PAN_A</name>
              <description>PPME_A: PAN selector 0x0 - filter set a assigned to PAN0 0x1 - filter set a assigned to PAN1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPME_FILTERFAIL_ENABLE</name>
              <description>If set 1'b1, PPME Filterfail_code0/1 is disabled for RECD_ON_PAN_0/1_EARLY evaluation, regardless if PPME is setup for &quot;phase2&quot; frame header checking for PP -unsupported frame types if reset (1'b0), PPME Fitlerfail_codes are evaluated for RECD_ON_PAN_0/1_EARLY evaluation</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPME_SECURITY_ENABLED_OVRD</name>
              <description>Override that the &quot;security_enabled&quot; packet header field when set is clearing PPME filterfail codes. If set 1'b1, ppme_fitlerfail_codes are not cleared regardless of security_enabled</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKT_FLTR_FRM_VER_A</name>
              <description>PPME_A: Packet Filter Frame Version selector for filter set a. The incoming packet's Frame Control Field is parsed to obtain the FrameVersion subfield, and that value is compared against this register, in accordance with the following: xxx1: Accept received packets with FrameVersion=00 xx1x: Accept received packets with FrameVersion=01 x1xx: Accept received packets with FrameVersion=10 1xxx: Accept received packets with FrameVersion=11</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKT_FLTR_FRM_TYPE_A</name>
              <description>PPME fiter A: Packet type selector for filter set a. Packet type can be parsed from Frame Control field and can be used to filter the packet types as per the settings in this register. xxxxxxx1 - Accept packets with Frame Type Beacon xxxxxx1x - Accept packets with Frame Type Data xxxxx1xx - Accept packets with Frame Type Acknowledgement xxxx1xxx - Accept packets with Frame Type MAC command. xxx1xxxx - Accept packets with Frame Type Reserved xx1xxxxx - Accept packets with Frame Type Multipurpose x1xxxxxx - Accept packets with Frame Type Fragment or Frak 1xxxxxxx - Accept packets with Frame Type Extended</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
