nxp-mcuxpresso/mcux-soc-svd/MCXW70AA/MCXW70AA.xml
        <register>
          <name>FEC_CFG2</name>
          <description>FEC CONFIG 2</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3F7F10</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TB_LENGTH</name>
              <description>Trace-back length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAT_VL</name>
              <description>Saturation value for PM</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LARGE_VL</name>
              <description>Large value used at startup phase, assigned to the initial PMs.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIDX</name>
              <description>Index of startup state. PM(startStIdx)=0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPREAD_CFG</name>
          <description>SPREADER CONFIG</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC0200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SP_EN</name>
              <description>Spreader Enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP_EN_0</name>
                  <description>Disable spreader</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP_EN_1</name>
                  <description>Enable spreader</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPOV_EN</name>
              <description>Spreader Override Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPOV_EN_0</name>
                  <description>Does not allow active override of the spreading enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPOV_EN_1</name>
                  <description>Allows active override of the spreading enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CI_TX</name>
              <description>Bluetooth LE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CI_TX_0</name>
                  <description>FEC Block 2 coded using S=8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CI_TX_1</name>
                  <description>FEC Block 2 coded using S=2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SP_START_BYTE</name>
              <description>Spread Start Byte</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SP_FACTOR</name>
              <description>Spreading Factor</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP_FACTOR_0</name>
                  <description>Factor = 1(No spreading and despreading)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP_FACTOR_1</name>
                  <description>Factor = 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP_FACTOR_2</name>
                  <description>Factor = 4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP_FACTOR_3</name>
                  <description>Factor = 8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP_FACTOR_4</name>
                  <description>Factor = 16</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SP_SEQ</name>
              <description>Spreading Bit Sequence</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WHT_CFG</name>
          <description>WHITEN CONFIG</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2001000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>W1_EN</name>
              <description>Enable first whitener</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WFIRST</name>
              <description>Whitens before CRC</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WTOV_EN</name>
              <description>Allows overwrite of the whitening</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WT_OUT_SEL</name>
              <description>Selected Output</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WT_TPOGY</name>
              <description>Whiten 1 Polynomial Type</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_SZ</name>
          <description>PACKET SIZE</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x224000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAX_PKT_SZ</name>
              <description>Maximum Packet Size In Bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEF_PKT_SZ</name>
              <description>Default Packet Size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRC_PHR_SZ</name>
          <description>LENGTH OF PHR CONFIG</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PHR_SZ</name>
              <description>PHR Size Config</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCP_CFG</name>
          <description>FCP SUPPORT CONFIG</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FCP_SUPPORT</name>
              <description>FCP Support</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCP_SUPPORT_0</name>
                  <description>Disable FCP support</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCP_SUPPORT_1</name>
                  <description>Enable FCP support</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FRAME_OVER_SZ</name>
          <description>FRAME OVERRIDE SIZE</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STD_FRM_OV_EN</name>
              <description>Overrides active STD frame length from link layer enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STD_FRM_OV_EN_0</name>
                  <description>Disable override active STD frame length from link layer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STD_FRM_OV_EN_1</name>
                  <description>Enable override active STD frame length from link layer</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STD_FRM_OV</name>
              <description>Value to override the STD frame length (bits)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FEC_BSZ_OV_B4SP</name>
          <description>OVERRIDE OF FEC BLOCK SIZE</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEC_BSZ_OV_B4SP_EN</name>
              <description>Override of the FEC block size for data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FEC_BSZ_OV_B4SP_EN_0</name>
                  <description>Disable Override actvie STD frame length from link layer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FEC_BSZ_OV_B4SP_EN_1</name>
                  <description>Enable Override actvie STD frame length from link layer</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FEC_BSZ_OV</name>
              <description>Value of the override in bits. It is for test purpose.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LEG0_CFG</name>
          <description>LEG0 CONFIG</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF202DD00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LEG0_INV_EN</name>
              <description>Whiten invert enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEG0_INV_EN_0</name>
                  <description>Disable whiten invert for LEG0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEG0_INV_EN_1</name>
                  <description>Enable whiten invert for LEG0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEG0_SUP</name>
              <description>LEG0 support</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEG0_SUP_0</name>
                  <description>Disable LEG0 support</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEG0_SUP_1</name>
                  <description>Enable LEG0 support</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEG0_XOR_BYTE</name>
              <description>LEG0 whitening masking byte</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEG0_XOR_RP_BYTE</name>
              <description>LEG0 repeat bytes masking</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEG0_XOR_FST_BYTE</name>
              <description>FEC first byte masking</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NPAYL_OVER_SZ</name>
          <description>OVERRIDE PAYLOAD</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NPAYL_OV_EN</name>
              <description>Override the internal payload length computation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NPAYL_OV_EN_0</name>
                  <description>Disable override the internal payload length</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NPAYL_OV_EN_1</name>
                  <description>Enable override the internal payload length</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT_FEC_FLUSH</name>
              <description>Value to override the payload length (bits)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NPAYL_OV</name>
              <description>no description available</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM_S_ADDR</name>
          <description>PACKET RAM SOURCE ADDRESS</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RAM_S_ADDR</name>
              <description>Packet RAM source address. This address is ram physical address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM_D_ADDR</name>
          <description>PACKET RAM DESTINATION ADDRESS</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RAM_D_ADDR</name>
              <description>Packet RAM destination address, this address is ram physical address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
