nxp-mcuxpresso/mcux-soc-svd/MCXW70AA/MCXW70AA.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>XCVR_RX_DIG</name>
      <description>2P4GHZ_RX_DIG</description>
      <groupName>XCVR_RX_DIG</groupName>
      <baseAddress>0x40107000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL0</name>
          <description>RXDIG Control 0</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC_CLIP_EN</name>
              <description>ADC Output Clip Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_CLIP_EN_0</name>
                  <description>ADC clip is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_CLIP_EN_1</name>
                  <description>ADC clip is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_IQMC_EN</name>
              <description>IQ Mismatch Compensation Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_IQMC_EN_0</name>
                  <description>IQ mismatch compensation is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_IQMC_EN_1</name>
                  <description>IQ mismatch compensation is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIG_MIXER_FREQ</name>
              <description>Digital Mixer Frequency</description>
              <bitOffset>2</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIG_MIXER_PH_EN</name>
              <description>Mixer Phase Compensation Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CIC_ORDER</name>
              <description>CIC Order(Stage) Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CIC_ORDER_0</name>
                  <description>4-stage CIC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CIC_ORDER_1</name>
                  <description>3-stage CIC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIC_RATE</name>
              <description>CIC Decimation Rate</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CIC_RATE_0</name>
                  <description>Decimation Rate is 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CIC_RATE_1</name>
                  <description>Decimation Rate is 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CIC_RATE_2</name>
                  <description>Decimation Rate is 4.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CIC_RATE_3</name>
                  <description>Decimation Rate is 8.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CIC_RATE_4</name>
                  <description>Decimation Rate is 16.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CIC_RATE_5</name>
                  <description>Decimation Rate is 32.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_DIG_GAIN</name>
              <description>RX Digital Gain Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_DIG_GAIN_0</name>
                  <description>Digital gain value is 1.000.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_DIG_GAIN_1</name>
                  <description>Digital gain value is 1.125.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_DIG_GAIN_2</name>
                  <description>Digital gain value is 1.250.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_DIG_GAIN_3</name>
                  <description>Digital gain value is 1.375.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_DIG_GAIN_4</name>
                  <description>Digital gain value is 1.500.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_DIG_GAIN_5</name>
                  <description>Digital gain value is 1.625.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_DIG_GAIN_6</name>
                  <description>Digital gain value is 1.750.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_DIG_GAIN_7</name>
                  <description>Digital gain value is 1.875.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_ACQ_FILT_LEN</name>
              <description>Acquisition Filter Length</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_ACQ_FILT_LEN_0</name>
                  <description>Acquisition filter length is 24.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_ACQ_FILT_LEN_1</name>
                  <description>Acquisition filter length is 16.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_ACQ_FILT_BYPASS</name>
              <description>Acquisition Filter Bypass</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_ACQ_FILT_BYPASS_0</name>
                  <description>Acquisition filter is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_ACQ_FILT_BYPASS_1</name>
                  <description>Acquisition filter is bypassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_SRC_EN</name>
              <description>RX Sample Rate Converter Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_SRC_EN_0</name>
                  <description>SRC is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_SRC_EN_1</name>
                  <description>SRC is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_IQ_8B_OUT_MODE</name>
              <description>RX 8-bit IQ Output Mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_IQ_8B_OUT_MODE_0</name>
                  <description>Disable 8-bit IQ output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_IQ_8B_OUT_MODE_1</name>
                  <description>{I[10],I[9:3]}, {Q[10],Q[9:3]}</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_IQ_8B_OUT_MODE_2</name>
                  <description>{I[10],I[8:2]}, {Q[10],Q[8:2]}</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_IQ_8B_OUT_MODE_3</name>
                  <description>{I[10],I[7:1]}, {Q[10],Q[7:1]}</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_IQ_8B_OUT_MODE_4</name>
                  <description>Dynamic scaling</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_FSK_ZB_SEL</name>
              <description>PHY/Demodulator selection</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_FSK_ZB_SEL_0</name>
                  <description>2.4GHz PHY is selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_FSK_ZB_SEL_1</name>
                  <description>15.4 PHY is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_DEMOD_IN_SEL</name>
              <description>Rx Demod Input Sel</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_DEMOD_IN_SEL_0</name>
                  <description>Source is output channel filter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_DEMOD_IN_SEL_1</name>
                  <description>Source is output acquisition filter</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIC_CNTR_FREE_RUN_EN</name>
              <description>CIC Dec Counter Free Run Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_AGC_EN</name>
              <description>AGC Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_AGC_EN_0</name>
                  <description>AGC is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_AGC_EN_1</name>
                  <description>AGC is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DR_OVRD_IN_CTE</name>
              <description>DATARATE_CONFIG_SEL Override In CTE</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL0_DRS</name>
          <description>RXDIG Control 0 DRS</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20C0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIG_MIXER_FREQ</name>
              <description>Digital Mixer Frequency</description>
              <bitOffset>2</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CIC_ORDER</name>
              <description>CIC Order(Stage) Selection</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CIC_ORDER_0</name>
                  <description>4-stage CIC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CIC_ORDER_1</name>
                  <description>3-stage CIC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIC_RATE</name>
              <description>CIC Decimation Rate</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CIC_RATE_0</name>
                  <description>Decimation Rate is 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CIC_RATE_1</name>
                  <description>Decimation Rate is 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CIC_RATE_2</name>
                  <description>Decimation Rate is 4.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CIC_RATE_3</name>
                  <description>Decimation Rate is 8.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CIC_RATE_4</name>
                  <description>Decimation Rate is 16.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CIC_RATE_5</name>
                  <description>Decimation Rate is 32.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
