nxp-mcuxpresso/mcux-soc-svd/MCXW70AA/MCXW70AA.xml
        <register>
          <name>CTUNE_CTRL</name>
          <description>PLL Coarse Tune Control</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTUNE_TARGET_MANUAL</name>
              <description>Manual Coarse Tune Target</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTUNE_CNTR_RLS_RST</name>
              <description>Coarse Tune Counter Release Reset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTUNE_TARGET_DISABLE</name>
              <description>Disable Coarse Tune Target</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTUNE_ADJUST</name>
              <description>Coarse Tune Count Adjustment</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTUNE_MANUAL</name>
              <description>Manual Coarse Tune Setting</description>
              <bitOffset>21</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTUNE_DISABLE</name>
              <description>Coarse Tune Disable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_RATE_OVRD_CTRL1</name>
          <description>PLL Data Rate Override Control</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8000188</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HPM_CAL_SCALE_CFG1</name>
              <description>HPM Scale Configuration1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPM_SCALE_CFG1</name>
              <description>LPM Scale Configuration1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_FDB_RES_CAL_CFG1</name>
              <description>HPM FDB RES Calibration Configuration1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_FDB_RES_TX_CFG1</name>
              <description>HPM FDB RES Transmit Configuration1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_BUMP_RX_TX_EN_CFG1</name>
              <description>HPM BUMP RX/TX enable Configuration1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_VCM_RX_CFG1</name>
              <description>HPM VCM RX Configuration1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_FDB_RES_RX_CFG1</name>
              <description>HPM FDB RES RX Configuration1</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_RATE_OVRD_CTRL2</name>
          <description>PLL Data Rate Override Control</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x180000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NUM_OFFSET_CFG1</name>
              <description>Numerator Offset Configuration1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTUNE_RES</name>
          <description>PLL Coarse Tune Results</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTUNE_SELECTED</name>
              <description>Coarse Tune Setting to VCO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CTUNE_BEST_DIFF</name>
              <description>Coarse Tune Absolute Best Difference</description>
              <bitOffset>10</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CTUNE_FREQ_SELECTED</name>
              <description>Coarse Tune Frequency Selected</description>
              <bitOffset>18</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPM_CAL_TIMING</name>
          <description>PLL HPM Calibration Timing Attributes</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HPM_CTUNE_SETTLE_TIME</name>
              <description>CTUNE Settling Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_CAL1_SETTLE_TIME</name>
              <description>HPM Calibration1 Settling Time</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_CAL2_SETTLE_TIME</name>
              <description>HPM Calibration2 Settling Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_VCO_MOD_DELAY</name>
              <description>HPM VCO Modification Output Delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_OFFSET_CTRL</name>
          <description>PLL Offset Control</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_NUMERATOR_OFFSET</name>
              <description>PLL Numerator Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_DATARATE_CTRL</name>
          <description>PLL Data Rate Switch Control</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6612</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HPM_VCM_TX_DRS</name>
              <description>Data Rate Switch for hpm_vcm_tx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HPM_VCM_TX_DRS_0</name>
                  <description>432 mV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_TX_DRS_1</name>
                  <description>328 mV</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_TX_DRS_2</name>
                  <description>456 mV</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_TX_DRS_3</name>
                  <description>473 mV</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_TX_DRS_4</name>
                  <description>488 mV</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_TX_DRS_5</name>
                  <description>408 mV</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_TX_DRS_6</name>
                  <description>392 mV</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_TX_DRS_7</name>
                  <description>376 mV</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPM_VCM_CAL_DRS</name>
              <description>Data Rate Switch for hpm_vcm_cal</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HPM_VCM_CAL_DRS_0</name>
                  <description>432 mV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_CAL_DRS_1</name>
                  <description>328 mV</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_CAL_DRS_2</name>
                  <description>456 mV</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_CAL_DRS_3</name>
                  <description>473 mV</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_CAL_DRS_4</name>
                  <description>488 mV</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_CAL_DRS_5</name>
                  <description>408 mV</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_CAL_DRS_6</name>
                  <description>392 mV</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_VCM_CAL_DRS_7</name>
                  <description>376 mV</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_VCO_TRIM_KVM_TX_DRS</name>
              <description>Data Rate Switch for pll_vco_trim_kvm_tx.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL_VCO_TRIM_KVM_TX_DRS_0</name>
                  <description>10MHz/V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_VCO_TRIM_KVM_TX_DRS_4</name>
                  <description>20MHz/V</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_VCO_TRIM_KVM_TX_DRS_6</name>
                  <description>30MHz/V</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_VCO_TRIM_KVM_TX_DRS_7</name>
                  <description>40MHz/V</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_VCO_TRIM_KVM_CAL_DRS</name>
              <description>Data Rate Switch for pll_vco_trim_kvm_cal</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL_VCO_TRIM_KVM_CAL_DRS_0</name>
                  <description>10MHz/V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_VCO_TRIM_KVM_CAL_DRS_4</name>
                  <description>20MHz/V</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_VCO_TRIM_KVM_CAL_DRS_6</name>
                  <description>30MHz/V</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_VCO_TRIM_KVM_CAL_DRS_7</name>
                  <description>40MHz/V</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM_SDM_DELAY_DRS</name>
              <description>DRS LPM_SDM_DELAY</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_SDM_DELAY_DRS</name>
              <description>DRS HPM_SDM_DELAY</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_INTEGER_DELAY_DRS</name>
              <description>DRS HPM_SDM_DELAY</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_COUNT_ADJUST_DRS</name>
              <description>HPM_COUNT_ADJUST_DRS</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_PHASE_COMPENSATION</name>
          <description>PLL phase compensation</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN_INPR</name>
              <description>Enable for feature Inline phase return ranging</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_INPR_RX_NORM</name>
              <description>Enable for Inline phase return feature, rx_norm contribution</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_COMP_INV</name>
              <description>Rx phase compensation inversion</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPR_DT</name>
              <description>Inline phase return ranging integration period</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_00</name>
                  <description>4 SDM clock cycles, 0.0625us</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_01</name>
                  <description>8 SDM clock cycles, 0.125us</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_10</name>
                  <description>16 SDM clock cycles, 0.25us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_11</name>
                  <description>32 SDM clock cycles, 0.5us</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPR_CORR_INV</name>
              <description>INPR_CORR_INV</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPR_TX_TQI_DIS</name>
              <description>INPR_TX_TQI_DIS</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPR_START_TUNING</name>
              <description>Fine phase shift start for inline phase return</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPR_TX_T_EXT_TQI_EN</name>
              <description>INPR_TX_T_EXT_TQI_EN</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPR_TX_PA_PUP_TQI_EN</name>
              <description>INPR_TX_PA_PUP_TQI_EN</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_PLL_PHASE_SHIFT</name>
              <description>PLL phase shift</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PHASE_COMP_DT</name>
              <description>RX compensation phase integration period</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>_00</name>
                  <description>4 SDM clock cycles, 0.0625us</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_01</name>
                  <description>8 SDM clock cycles, 0.125us</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_10</name>
                  <description>16 SDM clock cycles, 0.25us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_11</name>
                  <description>32 SDM clock cycles, 0.5us</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_PHASE_COMP_START_TUNING</name>
              <description>Fine phase shift start for RX phase compensation</description>
              <bitOffset>20</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
