nxp-mcuxpresso/mcux-soc-svd/MCXW70AA/MCXW70AA.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>TX_PACKET_RAM</name>
      <description>RADIO_PACKET_RAM</description>
      <groupName>TX_PACKET_RAM</groupName>
      <baseAddress>0x40108000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>1024</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PACKET_RAM_[%s]</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RX_PACKET_RAM</name>
      <description>RADIO_PACKET_RAM</description>
      <groupName>RX_PACKET_RAM</groupName>
      <baseAddress>0x40109000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x800</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>512</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PACKET_RAM_[%s]</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CIU2</name>
      <description>ciu2</description>
      <groupName>CIU2</groupName>
      <baseAddress>0x4010A000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x258</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CIU2_BTU_CTRL</name>
          <description>BTU Control and Status</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>btu_cipher_en</name>
              <description>Bluetooth Cipher Logic</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dbus_high_speed_sel</name>
              <description>Dbus High Speed Select Signal for Greater than 4 MHz</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_clk_sel</name>
              <description>Bluetooth sys Clock Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_ip_ser_sel</name>
              <description>bt_ip_ser_sel</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>btu_mc_wakeup</name>
              <description>BTU MC_Wakeup Status</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_BTU_ECO_CTRL</name>
          <description>BTU ECO Control</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xAAAAAAAA</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>eco_bits</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_INT_MASK</name>
          <description>CIU2 Interrupt Mask</description>
          <addressOffset>0x1A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mask</name>
              <description>Interrupt Mask for CIU2 Interrupts</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_INT_SELECT</name>
          <description>CIU2 Interrupt Select</description>
          <addressOffset>0x1A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sel</name>
              <description>Interrupt Read/Write Clear for CIU2 Interrupts</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_INT_EVENT_MASK</name>
          <description>CIU2 Interrupt Event Mask</description>
          <addressOffset>0x1A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mask</name>
              <description>Interrupt Event Mask for CIU2 Interrupts</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_INT_STATUS</name>
          <description>CIU2 Interrupt Status</description>
          <addressOffset>0x1AC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ciu_isr</name>
              <description>CIU2 Interrupt Status (ISR)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_TESTBUS_CTRL</name>
          <description>CPU2 debug register</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>testbus_sel</name>
              <description>Select testbus debug output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_LBC_CTRL</name>
          <description>LBC Control and Status</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lbc_nco_en</name>
              <description>LBC NCO Enable Signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>lbc_debug_ctrl</name>
              <description>LBC Debug Control Signal</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dejit_en</name>
              <description>De-jitter Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>auto_dejit</name>
              <description>Auto de-jitter</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>man_sel_nco</name>
              <description>Manual select NCO</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>nco_lpo_ramp_dn</name>
              <description>Status nco_lpo_ramp_dn</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ref_lpo_clk_good</name>
              <description>Status ref_lpo_clk_good</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ref_lpo_ramp_dn</name>
              <description>Status ref_lpo_ramp_dn</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>lpo_clk_sel_fsm</name>
              <description>Status lpo_clk_sel_fsm</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>lpo_clk_3k2_cnt</name>
              <description>Status lpo_clk_3k2_cnt, 3.2KHz Count</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_LBC_SLPCLK_NCO</name>
          <description>LBC NCO Step for Sleep Clock</description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x19000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>step</name>
              <description>LBC NCO step for sleep clock. Please refer to design spreadsheet for more details.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
