nxp-mcuxpresso/mcux-soc-svd/MCXW70AA/MCXW70AA.xml
        <register>
          <name>ble_reg_int_cfg_01</name>
          <description>BLE Interrupt Configuration, Used to route individual interrupt source to either BLE_REG_INT_STS_0 or BLE_REG_INT_STS_1.</description>
          <addressOffset>0x780</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rt_err_intr</name>
              <description>rt_err_intr interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>pst_2_intr</name>
              <description>pst_2_intr interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>pst_1_intr</name>
              <description>pst_1_intr interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>pst_0_intr</name>
              <description>pst_0_intr interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cdt_expiry_intr_5</name>
              <description>cdt_expiry_intr[5] interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cdt_expiry_intr_4</name>
              <description>cdt_expiry_intr[4] interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cdt_expiry_intr_3</name>
              <description>cdt_expiry_intr[3] interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cdt_expiry_intr_2</name>
              <description>cdt_expiry_intr[2] interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cdt_expiry_intr_1</name>
              <description>cdt_expiry_intr[1] interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cdt_expiry_intr_0</name>
              <description>cdt_expiry_intr[0] interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_intr_3</name>
              <description>expiry_intr[3] interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_intr_2</name>
              <description>expiry_intr[2] interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_intr_1</name>
              <description>expiry_intr[1] interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_intr_0</name>
              <description>expiry_intr[0] interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tmr_abort_intr</name>
              <description>tmr_abort_intr interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>hw_abort_intr</name>
              <description>hw_abort_intr interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_abort_intr</name>
              <description>sw_abort_intr interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_pkt_done_intr</name>
              <description>rx_pkt_done_intr interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_data_done_intr</name>
              <description>rx_data_done_intr interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_adv_ext_header_done_intr</name>
              <description>rx_adv_ext_header_done_intr interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>irk_resolve_done_intr</name>
              <description>irk_resolve_done_intr interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_adv_addr_done_intr</name>
              <description>rx_adv_addr_done_intr interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_hdr_done_intr</name>
              <description>rx_hdr_done_intr interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cor_hit_intr</name>
              <description>cor_hit_intr interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_pkt_done_intr</name>
              <description>tx_pkt_done_intr interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_data_done_intr</name>
              <description>tx_data_done_intr interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_hdr_done_intr</name>
              <description>tx_hdr_done_intr interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_acc_done_intr</name>
              <description>tx_acc_done_intr interrupt configuration, 0x0: route to BLE_REG_INT_STS_0, 0x1: route to BLE_REG_INT_STS_1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_int_delay_ctrl_01</name>
          <description>BLE Interrupt Delay Control</description>
          <addressOffset>0x784</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_pkt_done_intr</name>
              <description>delay rx_pkt_done_intr interrupt assertion, 0x0: no delay, 0x1: delay interrupt assertion until DMA is done writing timestamp and status fields, into RD.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_pkt_done_intr</name>
              <description>delay tx_pkt_done_intr interrupt assertion, 0x0: no delay, 0x1: delay interrupt assertion until DMA is done writing timestamp and status fields, into TD.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_int_sw_mbox</name>
          <description>Software Mailbox Interrupt</description>
          <addressOffset>0x788</addressOffset>
          <size>32</size>
          <access>read-writeOnce</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sw_mbox</name>
              <description>software Mailbox Interrupt, Writing 1 to cause sw_mailbox_intr interrupt to be generated. This bit is self-cleared by hardware.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_tmr_swt_ctl_0</name>
          <description>Software Timer 0: Control</description>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>timer_en</name>
              <description>Set Timer Enable, This bit is self clearing by hardware after timer expires., 0x0: disable timer, 0x1: enable timer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_emask_tx</name>
              <description>Event Mask: Tx, Expiration Event Mask for triggering an Tx transaction., 0x0: no event, 0x1: Tx event triggered at timer expiry</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_emask_rx</name>
              <description>Event Mask: Rx, Expiration Event Mask for triggering an Rx transaction., 0x0: no event, 0x1: Rx event triggered at timer expiry</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_emask_intr</name>
              <description>Event Mask: Interrupt, Expiration Event Mask for Interrupt, 0x0: no event, 0x1: interrupt triggered at expiry of timer</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_emask_abort</name>
              <description>Event Mask: Abort, Expiration Event Mask for Abort, 0x0: no event, 0x1: Tx/Rx abort triggered at expiry of timer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_emask_cs</name>
              <description>Event Mask: CS event for KW PHY, Expiration Event Mask for triggering a CS transaction to KW PHY, 0x0: no event, 0x1: CS event triggered at timer expiry</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>slot_mask</name>
              <description>Slot Mask, This register is a 2 bit LSB mask on the clock comparator. If both bits are cleared; then the events will assert regardless of the matching state of the LSB bits., frame,0x0: timer works on frame basis, 0x1: invalid, slot,0x2: timer works on slot basis, halfslot,0x3: timer works on half slot basis</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>allow_current_expiry</name>
              <description>Allow current SWT expiry with chained CDT; for CDT Matching mode, SWT configuration for new CDT chaining mode. SWT programming with current native clock values would be considered valid; past expiry_status won't be set. SWT expiry events like TX; RX; HW Abort; and CS still cannot be triggered if programming time half slot is &lt;= current native clock. SWT interrupt will also not get generated at such values (since it is too late). Added for KFOURWONE-2451, 0x0: SWT is configured in original mode where current native clock value is, considered to be in the past, 0x1: SWT is configured in new CDT matching mode where current native clock value is, allowed to trigger chained CDTs</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_tmr_swt_value_0</name>
          <description>Software Timer 0: Expiration Value</description>
          <addressOffset>0x804</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>expiry_value</name>
              <description>Expiry Value, Bluetooth native clock value for event generation. When the Bluetooth native clock equals this value; the events are triggered.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_tmr_swt_sts_0</name>
          <description>Software Timer 0: Expiration Status</description>
          <addressOffset>0x808</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>expiry_status</name>
              <description>Expiry Status, This bit is updated at each expiry. Once set it remains set until this SWT expires again. For the purpose of this register; past value on SWT refers to a value up to 12 hours before the current BTC native clock value., 0x0: SWT expired at programmed value without any errors, 0x1: SWT was programmed for a value that is in the past</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>skip_status</name>
              <description>Clock skipping Status, This bit is updated each time the LPO version of nativeClock skips any number of values AND a previously programmed timer expiry got skipped. This is likely to happen only when BTC is entering sleep state when the LPO version of native clock MAY be updated with the most accurate value., 0x0: SWT expired at programmed value without any skipping error, 0x1: Current timer expiry is due to clock skipping over the programmed expiration, value</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>swt_conf_valid</name>
              <description>SWT Configuration Valid Indication, Indicates when SWT configurations are registered into sleep clock domain Bit is set when configurations are registered in slow domain and reset at SWT expiry; for both successful expiry as well as past value expiry, 0x0: SWT configuration is not registered into slow clock domain yet, 0x1: SWT configuration is safely registered into slow clock domain</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_tmr_swt_ctl_1</name>
          <description>Software Timer 1: Control</description>
          <addressOffset>0x810</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>timer_en</name>
              <description>Set Timer Enable, This bit is self clearing by hardware after timer expires., 0x0: disable timer, 0x1: enable timer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_emask_tx</name>
              <description>Event Mask: Tx, Expiration Event Mask for triggering an Tx transaction., 0x0: no event, 0x1: Tx event triggered at timer expiry</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_emask_rx</name>
              <description>Event Mask: Rx, Expiration Event Mask for triggering an Rx transaction., 0x0: no event, 0x1: Rx event triggered at timer expiry</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_emask_intr</name>
              <description>Event Mask: Interrupt, Expiration Event Mask for Interrupt, 0x0: no event, 0x1: interrupt triggered at expiry of timer</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_emask_abort</name>
              <description>Event Mask: Abort, Expiration Event Mask for Abort, 0x0: no event, 0x1: Tx/Rx abort triggered at expiry of timer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>expiry_emask_cs</name>
              <description>Event Mask: CS event for KW PHY, Expiration Event Mask for triggering a CS transaction to KW PHY, 0x0: no event, 0x1: CS event triggered at timer expiry</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>slot_mask</name>
              <description>Slot Mask, This register is a 2 bit LSB mask on the clock comparator. If both bits are cleared; then the events will assert regardless of the matching state of the LSB bits., frame,0x0: timer works on frame basis, 0x1: invalid, slot,0x2: timer works on slot basis, halfslot,0x3: timer works on half slot basis</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>allow_current_expiry</name>
              <description>Allow current SWT expiry with chained CDT; for CDT Matching mode, SWT configuration for new CDT chaining mode. SWT programming with current native clock values would be considered valid; past expiry_status won't be set. SWT expiry events like TX; RX; HW Abort; and CS still cannot be triggered if programming time half slot is &lt;= current native clock. SWT interrupt will also not get generated at such values (since it is too late). Added for KFOURWONE-2451, 0x0: SWT is configured in original mode where current native clock value is, considered to be in the past, 0x1: SWT is configured in new CDT matching mode where current native clock value is, allowed to trigger chained CDTs</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
