nxp-mcuxpresso/mcux-soc-svd/MCXW70AA/MCXW70AA.xml
        <register>
          <name>ble_reg_ant_switch_rx_map_7</name>
          <description>Rx Antenna Switch Map: Map 7</description>
          <addressOffset>0x950</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_ant_switch_index_0</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_1</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_2</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_3</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_ant_switch_rx_map_8</name>
          <description>Rx Antenna Switch Map: Map 8</description>
          <addressOffset>0x954</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_ant_switch_index_0</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_1</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_2</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_3</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_ant_switch_rx_map_9</name>
          <description>Rx Antenna Switch Map: Map 9</description>
          <addressOffset>0x958</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_ant_switch_index_0</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_1</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_2</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ant_switch_index_3</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_RX_MAP_0; and follows the index order of rx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_RX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_RX_MAP_1.2.to 9. The pattern length use is determined by rx_ant_map_length.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_ahbw_fsm_mon_cntrl</name>
          <description>BLE AHBW FSM Monitor and Reset Control</description>
          <addressOffset>0xE00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rd_st</name>
              <description>rd_st value, Current value of ble_rd state machine rd_st.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reset_rd_st</name>
              <description>reset rd_st and mst_arb_st, To reset rd_st state machine back to Idle state; firmware first writes 1 and then writes 0 to this bit. If ble_ahb_arb FSM mst_arb_st is servicing ble_rd; it will be reset together.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>td_st</name>
              <description>td_st value, Current value of ble_td state machine td_st.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reset_td_st</name>
              <description>reset td_st and mst_arb_st, To reset td_st state machine back to Idle state; firmware first writes 1 and then writes 0 to this bit. If ble_ahb_arb FSM mst_arb_st is servicing ble_td; it will be reset together.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rl_st</name>
              <description>rl_st value, Current value of ble_reg_ldr state machine rl_st.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reset_rl_st</name>
              <description>reset rl_st and mst_arb_st, To reset rl_st state machine back to Idle state; firmware first writes 1 and then writes 0 to this bit. If ble_ahb_arb FSM mst_arb_st is servicing ble_reg_ldr; it will be reset together.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mst_arb_st</name>
              <description>mst_arb_st value, Current value of ble_ahb_arb state machine mst_arb_st.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>state</name>
              <description>state value, Current value of ble_ahb_mst state machine state.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reset_state</name>
              <description>reset state, To reset state state machine back to Idle state; firmware first writes 1 and then writes 0 to this bit.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_rx_fsm_mon_cntrl</name>
          <description>BLE Rx FSM Monitor and Reset Control</description>
          <addressOffset>0xE04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_fsm_state</name>
              <description>rx_fsm_state value, Current value of ble_rx_fsm state machine rx_fsm_state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reset_rx_fsm_state</name>
              <description>reset rx_fsm_state, To reset rx_fsm_state state machine back to Idle state; firmware first writes 1 and then writes 0 to this bit.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ctl_state</name>
              <description>rx_ctl_state value, Current value of ble_rx_ctl state machine rx_ctl_state.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reset_rx_ctl_state</name>
              <description>reset rx_ctl_state, To reset rx_ctl_state state machine back to Idle state; firmware first writes 1 and then writes 0 to this bit.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mem_ctl_state</name>
              <description>mem_ctl_state value, Current value of ble_rx_mem_ctl state machine mem_ctl_state.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reset_mem_ctl_state</name>
              <description>reset mem_ctl_state, To reset mem_ctl_state state machine back to Idle state; firmware first writes 1 and then writes 0 to this bit.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_tx_fsm_mon_cntrl</name>
          <description>BLE Tx FSM Monitor and Reset Control</description>
          <addressOffset>0xE08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx_fsm_state</name>
              <description>tx_fsm_state value, Current value of ble_tx_fsm state machine tx_fsm_state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reset_tx_fsm_state</name>
              <description>reset tx_fsm_state, To reset tx_fsm_state state machine back to Idle state; firmware first writes 1 and then writes 0 to this bit.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ctl_st</name>
              <description>tx_ctl_st value, Current value of ble_tx_ctl state machine tx_ctl_st.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reset_tx_ctl_st</name>
              <description>reset tx_ctl_st, To reset tx_ctl_st state machine back to Idle state; firmware first writes 1 and then writes 0 to this bit.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_mem_rd_st</name>
              <description>tx_mem_rd_st value, Current value of ble_tx_mem_ctl state machine tx_mem_rd_st.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_rd_st</name>
              <description>tx_rd_st value, Current value of ble_tx_mem_ctl state machine tx_rd_st.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reset_tx_mem_ctl</name>
              <description>reset the 2 state machines in ble_tx_mem_ctl, To reset both tx_rd_st and tx_mem_rd_st state machine back to Idle state; firmware first writes 1 and then writes 0 to this bit.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_ccm_fsm_mon_cntrl</name>
          <description>BLE CCM FSM Monitor and Reset Control</description>
          <addressOffset>0xE0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x300</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ccm_ctl_st</name>
              <description>ccm_ctl_st value, Current value of ble_ccm_ctl state machine ccm_ctl_st.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rx_pld_blk_rdy_st</name>
              <description>rx_pld_blk_rdy_st value, Current value of ble_ccm_ctl state machine rx_pld_blk_rdy_st.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reset_ccm_ctl</name>
              <description>reset the 2 state machines in ble_ccm_ctl, To reset both rx_pld_blk_rdy_st and ccm_ctl_st state machines back to Idle state; firmware first writes 1 and then writes 0 to this bit.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>arb_st</name>
              <description>arb_st value, Current value of btu_aes_arbiter state machine arb_st.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ccm_st</name>
              <description>ccm_st value, Current value of btu_ccm state machine ccm_st.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reset_btu_ccm_aes</name>
              <description>reset the 2 state machines in ble_ccm_aes, To reset both arb_st and ccm_st state machines back to Idle state; firmware first writes 1 and then writes 0 to this bit.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>aes0_arb_st</name>
              <description>aes0_arb_st, Current value of the hw aes arbiter state machine aes0_arb_st.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>aes1_arb_st</name>
              <description>aes1_arb_st, Current value of the sw aes arbiter state machine aes1_arb_st.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_debug_cntrl</name>
          <description>BLE Debug Test Bus Control</description>
          <addressOffset>0xE10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>testbus_cntrl</name>
              <description>BLE debug test bus output control, BLE testbus swapping control.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_ahb_mon_sel</name>
              <description>BLE AHB Master Debug Signals Selection, BLE AHB Master Debug Signals Selection, Select BLE AHB Data Bus, 0x0: hRdData[7:0], 0x1: hRdData[15:8], 0x2: hRdData[23:16], 0x3: hRdData[31:24], 0x4: hWrData[7:0], 0x5: hWrData[15:8], 0x6: hWrData[23:16], 0x7: hWrData[31:24]</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
