nxp-mcuxpresso/mcux-soc-svd/MCXW70AA/MCXW70AA.xml
        <register>
          <name>BTU_PTA_3DG_CLK_UPDATE_REFCLK_1</name>
          <description>Bluetooth Reference Clock Snapshot on BT_3DG_CLK_UPATE Pulse Interrupt</description>
          <addressOffset>0xF64</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BT3dgClkUpdate_refClk</name>
              <description>Bluetooth Reference Clock Snapshot on 3D-Glass Clock Update Pulse Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_3DG_CLK_UPDATE_REFPDB_CNT</name>
          <description>Bluetooth Reference pdBitCounter Snapshot on BT_3DG_CLK_UPDATE Pulse Interrupt</description>
          <addressOffset>0xF66</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BT3dgClkUpdate_pdBitCnt</name>
              <description>Bluetooth Reference pdBitCounter Snapshot on 3D-Glass Clock Update Pulse Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4</name>
          <description>MWS Scan Frequency Overlap Range 1~4</description>
          <addressOffset>0xF68</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mws_scan_ovlp_range_1</name>
              <description>MWS scan frequency overlap range 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_2</name>
              <description>MWS scan frequency overlap range 2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_3</name>
              <description>MWS scan frequency overlap range 3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_4</name>
              <description>MWS scan frequency overlap range 4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8</name>
          <description>MWS Scan Frequency Overlap Range 5~8</description>
          <addressOffset>0xF6A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mws_scan_ovlp_range_5</name>
              <description>MWS scan frequency overlap range 5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_6</name>
              <description>MWS scan frequency overlap range 6</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_7</name>
              <description>MWS scan frequency overlap range 7</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_8</name>
              <description>MWS scan frequency overlap range 8</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12</name>
          <description>MWS Scan Frequency Overlap Range 9~12</description>
          <addressOffset>0xF6C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mws_scan_ovlp_range_9</name>
              <description>MWS scan frequency overlap range 9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_10</name>
              <description>MWS scan frequency overlap range 10</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_11</name>
              <description>MWS scan frequency overlap range 11</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_12</name>
              <description>MWS scan frequency overlap range 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16</name>
          <description>MWS Scan Frequency Overlap Range 13~16</description>
          <addressOffset>0xF6E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mws_scan_ovlp_range_13</name>
              <description>MWS scan frequency overlap range 13</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_14</name>
              <description>MWS scan frequency overlap range 14</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_15</name>
              <description>MWS scan frequency overlap range 15</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_16</name>
              <description>MWS scan frequency overlap range 16</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20</name>
          <description>MWS Scan Frequency Overlap Range 17~20</description>
          <addressOffset>0xF70</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mws_scan_ovlp_range_17</name>
              <description>MWS scan frequency overlap range 17</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_18</name>
              <description>MWS scan frequency overlap range 18</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_19</name>
              <description>MWS scan frequency overlap range 19</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_20</name>
              <description>MWS scan frequency overlap range 20</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_SCAN_OVLP_RANGE_21_24</name>
          <description>MWS Scan Frequency Overlap Range 21~24</description>
          <addressOffset>0xF72</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mws_scan_ovlp_range_21</name>
              <description>MWS scan frequency overlap range 21</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_22</name>
              <description>MWS scan frequency overlap range 22</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_23</name>
              <description>MWS scan frequency overlap range 23</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_24</name>
              <description>MWS scan frequency overlap range 24</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_SCAN_OVLP_RANGE_25_28</name>
          <description>MWS Scan Frequency Overlap Range 25~28</description>
          <addressOffset>0xF74</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mws_scan_ovlp_range_25</name>
              <description>MWS scan frequency overlap range 25</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_26</name>
              <description>MWS scan frequency overlap range 26</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_27</name>
              <description>MWS scan frequency overlap range 27</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_28</name>
              <description>MWS scan frequency overlap range 28</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_SCAN_OVLP_RANGE_29_31</name>
          <description>MWS Scan Frequency Overlap Range 29~31</description>
          <addressOffset>0xF76</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mws_scan_ovlp_range_29</name>
              <description>MWS scan frequency overlap range 29</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_30</name>
              <description>MWS scan frequency overlap range 30</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_31</name>
              <description>MWS scan frequency overlap range 31</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL</name>
          <description>MWS Coex Early BT_RX_PRI Control</description>
          <addressOffset>0xF78</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x5000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>bt_rx_pri_mode</name>
              <description>BT_RX_PRI mode selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_rx_pri_page_resp_mst</name>
              <description>BT_RX_PRI assertion during page response at master side</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_rx_pri_inq_resp</name>
              <description>BT_RX_PRI assertion during inquiry response</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_rx_pri_page_resp_slv</name>
              <description>BT_RX_PRI assertion during page response at slave side</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_rx_pri_mst_tm_sel</name>
              <description>BT_RX_PRI advance timing selection in Real Time mode for Bluetooth master mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>select 100us range (BT_RX_PRI assertion is delayed by BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST from rifRx rising edge of the Rx packet)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>select 600us range (BT_RX_PRI assertion is delayed by BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST from rifTx rising edge of the preceding Tx packet)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>bt_rx_pri_page_resp_tm_sel</name>
              <description>BT_RX_PRI advance timing selection during master or slave page response</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>select 100us range. For master, BT_RX_PRI assertion is delayed by BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST from rifRx rising edge of each Rx ID packet. For slave, BT_RX_PRI assertion is delayed by BTU_PTA_MWS_COEX_BT_RX_PRI_START_SLV from rifRx rising edge of the Rx FHS packet.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>select 600us range. For master, BT_RX_PRI assertion is delayed by BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST from rifTx rising edge of the first Tx ID packet. For slave, BT_RX_PRI assertion is delayed by BTU_PTA_MWS_COEX_BT_RX_PRI_START_SLV from correlation hit of the first or second Rx ID packet.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>bt_rx_pri_inq_resp_tm_sel</name>
              <description>BT_RX_PRI advance timing selection during inquiry response</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>select 100us range. BT_RX_PRI assertion is delayed by BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST from rifRx rising edge of the FHS packet.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>select 600us range. BT_RX_PRI assertion is delayed by BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST from rifTx rising edge of the first Tx ID packet.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>early_bt_rx_pri_deass_fram_cnt</name>
              <description>Number of frames BT_RX_PRI should be de-asserted</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_rx_pri_drive</name>
              <description>Control BT_RX_PRI logic level directly</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_rx_pri_assrt_lvl</name>
              <description>Specify priority level to assert BT_RX_PRI for BR/EDR packet</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_rx_pri_assrt_lvl</name>
              <description>Specify priority level to assert BT_RX_PRI for BLE packet</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_MST</name>
          <description>MWS Coex Early BT_RX_PRI Start Offset for Master Mode</description>
          <addressOffset>0xF7A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>StartOffsetMst</name>
              <description>Start Offset in Master Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_SLV</name>
          <description>MWS Coex Early BT_RX_PRI Start Offset for Slave Mode</description>
          <addressOffset>0xF7C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>StartOffsetSlv</name>
              <description>Start Offset in Slave Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_COEX_BT_RX_PRI_START_SLV</name>
          <description>MWS Coex Signal BT_RX_PRI Start Timer for Slave Mode</description>
          <addressOffset>0xF7E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>btRxPriStartSlvReg</name>
              <description>BT_RX_PRI Start Timer for Slave Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
