nxp-mcuxpresso/mcux-soc-svd/MCXW70AA/MCXW70AA.xml
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved31</name>
              <description>Reserved</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Not supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FILT</name>
          <description>Pin Filter</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FILTSEL1</name>
              <description>Filter 1 Pin Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTE1</name>
              <description>Filter 1 Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (Detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (Detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (Detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTF1</name>
              <description>Filter 1 Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTSEL2</name>
              <description>Filter 2 Pin Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTE2</name>
              <description>Filter 2 Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (Detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (Detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (Detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTF2</name>
              <description>Filter 2 Flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PDC1</name>
          <description>Pin DMA/Trigger Configuration 1</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WUPDC0</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC1</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC2</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC3</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC4</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC5</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC6</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC7</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC8</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC9</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC10</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC11</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC12</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC13</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC14</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES</name>
                  <description>Reserved</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDC15</name>
              <description>Wake-up Pin Configuration for WUU_Pn</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ</name>
                  <description>DMA request</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER</name>
                  <description>Trigger event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
