nxp-mcuxpresso/mcux-soc-svd/MCXW70AA/MCXW70AA.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCON</name>
      <description>System Controller</description>
      <groupName>SYSCON</groupName>
      <baseAddress>0x4019E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xF04</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SYSCON0</name>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>SYSCON0_ECC</name>
        <value>46</value>
      </interrupt>
      <registers>
        <register>
          <name>CPU1_CACHE_ISCR</name>
          <description>CPU1 Cache Interrupt Status and Control</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CWBER</name>
              <description>Cache Write Buffer Error Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CWBER_0</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CWBER_1</name>
                  <description>Error occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CWBEE</name>
              <description>Cache Write Buffer Error Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CWBEE_0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CWBEE_1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU1_CACHE_FADR</name>
          <description>Write Buffer Fault Address</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>Write Buffer Fault Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU1_CACHE_FATR</name>
          <description>Store Buffer Fault Attributes</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>BEDA</name>
              <description>Bus Error Data Access Type</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BEDA_0</name>
                  <description>Instruction</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BEDA_1</name>
                  <description>Data</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BEMD</name>
              <description>Bus Error Privilege Level</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BEMD_0</name>
                  <description>User mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BEMD_1</name>
                  <description>Supervisor or privileged mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BESZ</name>
              <description>Bus Error Size</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BESZ_0</name>
                  <description>8-bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BESZ_1</name>
                  <description>16-bit</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BESZ_2</name>
                  <description>32-bit</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BEWT</name>
              <description>Bus Error Write</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BEWT_0</name>
                  <description>Read</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BEWT_1</name>
                  <description>Write</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BEMN</name>
              <description>Bus Error Master Number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BEOVR</name>
              <description>Bus Error Overrun</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BEOVR_0</name>
                  <description>No overrun</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BEOVR_1</name>
                  <description>Overrun</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU1_CACHE_FDR</name>
          <description>Store Buffer Fault Data</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>BFD</name>
              <description>Fault Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU1_CACHE_CPCR2</name>
          <description>Core Platform Control 2</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10050</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CCBC</name>
              <description>Clear Code Bus Cache</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCBC_0</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCBC_1</name>
                  <description>Clear code bus cache</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCCWB</name>
              <description>Disable Code Cache Write Buffer</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCCWB_0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCCWB_1</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCCNA</name>
              <description>Force Code Cache to No Allocation</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCCNA_0</name>
                  <description>Allocation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCCNA_1</name>
                  <description>No allocation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCBC</name>
              <description>Disable Code Bus Cache</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCBC_0</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCBC_1</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBCS</name>
              <description>Code Bus Cache Size</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBCS_0</name>
                  <description>0 KB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBCS_1</name>
                  <description>1 KB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBCS_2</name>
                  <description>2 KB</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBCS_3</name>
                  <description>4 KB</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBCS_4</name>
                  <description>8 KB</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBCS_5</name>
                  <description>16 KB</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBCS_6</name>
                  <description>32 KB</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCCMCTRL</name>
              <description>Bypass Fixed Code Cache Map</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCCMCTRL_0</name>
                  <description>Do not bypass</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCCMCTRL_1</name>
                  <description>Bypass</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCCPWB</name>
              <description>Limit Code Cache Peripheral Write Buffering</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCCPWB_0</name>
                  <description>Do not limit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCCPWB_1</name>
                  <description>Limit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU1_CACHE_LMDR</name>
          <description>CPU1_CACHE_LMDR</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xE0011FFF</resetMask>
          <fields>
            <field>
              <name>MT</name>
              <description>Memory Type</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MT_0</name>
                  <description>SRAM_L</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MT_1</name>
                  <description>SRAM_U</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MT_2</name>
                  <description>PC Cache</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MT_3</name>
                  <description>PS Cache</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RO</name>
              <description>Read-Only</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RO_0</name>
                  <description>Writes allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RO_1</name>
                  <description>Writes ignored</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPW</name>
              <description>LMEM Data Path Width</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPW_2</name>
                  <description>32 bits</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPW_3</name>
                  <description>64 bits</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WY</name>
              <description>Level 1 Cache Ways</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WY_0</name>
                  <description>No cache</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WY_2</name>
                  <description>2-way set associative</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WY_4</name>
                  <description>4-way set associative</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WY_8</name>
                  <description>8-way set associative</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LMSZ</name>
              <description>LMEM Size</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LMSZ_0</name>
                  <description>No memory</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_1</name>
                  <description>1 KB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_2</name>
                  <description>2 KB</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_3</name>
                  <description>4 KB</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_4</name>
                  <description>8 KB</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_5</name>
                  <description>16 KB</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_6</name>
                  <description>32 KB</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_7</name>
                  <description>64 KB</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_8</name>
                  <description>128 KB</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_9</name>
                  <description>256 KB</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_10</name>
                  <description>512 KB</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_11</name>
                  <description>1024 KB</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_12</name>
                  <description>2048 KB</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_13</name>
                  <description>4096 KB</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_14</name>
                  <description>8192 KB</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_15</name>
                  <description>16384 KB</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LMSZH</name>
              <description>LMEM Size Hole</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LMSZH_0</name>
                  <description>LMEM has a power-of-2 capacity</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZH_1</name>
                  <description>LMEM has a capacity of 0.75 * LMSZ</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>V</name>
              <description>Valid</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V_0</name>
                  <description>Not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1</name>
                  <description>Present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
