nxp-mcuxpresso/mcux-soc-svd/MCXW70AA/MCXW70AA.xml
        <register>
          <name>RF2p4GHz_STAT</name>
          <description>2.4GHz Radio Status Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x400</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WOR_WKUP_FLAG</name>
              <description>WOR Wakeup Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>MAN_WKUP_FLAG</name>
              <description>MAN Wakeup Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>BLE_WKUP_FLAG</name>
              <description>Bluetooth LE Wakeup Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RFACT_FLAG</name>
              <description>RF_ACTIVE Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>LP_WKUP_FLAG</name>
              <description>Low Power Wakeup Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>SLP_RDY_STAT</name>
              <description>RF_CMC Sleep Ready Status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RST_STAT</name>
              <description>Reset Status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RST_STAT_0</name>
                  <description>Reset is not asserted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RST_STAT_1</name>
                  <description>Reset is asserted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRO_CLK_VLD_STAT</name>
              <description>FRO Clock Valid Status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_REQ_STAT</name>
              <description>Low Power Request Status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_ACK_STAT</name>
              <description>Low Power Acknowledge Status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BLE_WKUP_STAT</name>
              <description>Bluetooth LE Wakeup Status</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WOR_STATE</name>
              <description>WOR Low Power State</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WOR_STATE_0</name>
                  <description>RESET state (WOR_EN=0).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WOR_STATE_1</name>
                  <description>ACTIVE state (XO enabled, RF_ACTIVE asserted, LP request deasserted).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WOR_STATE_2</name>
                  <description>SLEEP state (XO disabled, RF_ACTIVE deasserted, LP request asserted).</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WOR_STATE_3</name>
                  <description>WAKEUP state (XO enabled, RF_ACTIVE asserted after RFACT_WKUP_DLY, LP request deasserted after LP_WKUP_DLY).</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAN_STATE</name>
              <description>MAN Low Power State</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAN_STATE_0</name>
                  <description>RESET state (MAN_EN=0).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAN_STATE_1</name>
                  <description>ACTIVE state (XO enabled, RF_ACTIVE asserted, LP request deasserted).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAN_STATE_2</name>
                  <description>SLEEP state (XO disabled, RF_ACTIVE deasserted, LP request asserted).</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAN_STATE_3</name>
                  <description>WAKEUP state (XO enabled, RF_ACTIVE asserted after RFACT_WKUP_DLY, LP request deasserted after LP_WKUP_DLY).</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLE_STATE</name>
              <description>Bluetooth LE Low Power State</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLE_STATE_0</name>
                  <description>RESET state (BLE_LP_EN=0).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLE_STATE_1</name>
                  <description>ACTIVE state (XO enabled, RF_ACTIVE asserted, LP request deasserted).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLE_STATE_2</name>
                  <description>SLEEP state (XO disabled, RF_ACTIVE deasserted, LP request asserted).</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLE_STATE_3</name>
                  <description>WAKEUP state (XO enabled, RF_ACTIVE asserted after RFACT_WKUP_DLY, LP request deasserted after LP_WKUP_DLY).</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RF2p4GHz_COEXT</name>
          <description>2.4GHz Radio Coexistence Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RFGPO_OBE</name>
              <description>RF_GPO Output Buffer Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFGPO_SRC</name>
              <description>RF_GPO Source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RFGPO_SRC_0</name>
                  <description>RF_GPO[7:0] = {coext[3:0], fem_ctrl[3:0]}</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFGPO_SRC_1</name>
                  <description>RF_GPO[7:0] = {fem_ctrl[3:0], coext[3:0]}</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFGPO_SRC_2</name>
                  <description>RF_GPO[7:0] = {lant_lut_gpio[3:0], fem_ctrl[3:0]}</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFGPO_SRC_3</name>
                  <description>RF_GPO[7:0] = {fem_ctrl[3:0], lant_lut_gpio[3:0]}</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFGPO_SRC_4</name>
                  <description>RF_GPO[7:0] = {lant_lut_gpio[3:0], coext[3:0]}</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFGPO_SRC_5</name>
                  <description>RF_GPO[7:0] = {coext[3:0], lant_lut_gpio[3:0]}</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORTA_PWR</name>
              <description>PORTA Power</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA_PWR_0</name>
                  <description>PORTA pins do not remain powered (default behavior)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PWR_1</name>
                  <description>PORTA pins remain powered</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFACT_SRC</name>
              <description>RF_ACTIVE Source</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RFACT_SRC_0</name>
                  <description>RF_ACTIVE is driven by the RFMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFACT_SRC_1</name>
                  <description>RF_ACTIVE is driven by the TSM/LL</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFACT_SRC_2</name>
                  <description>RF_ACTIVE is driven by the Bluetooth LE wakeup request (bt_clk_req)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFACT_IDIS</name>
              <description>RF_ACTIVE Idle Disable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RFACT_IDIS_0</name>
                  <description>RF_ACTIVE does not deassert when TSM is idle (will deassert on next low power mode entry)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFACT_IDIS_1</name>
                  <description>RF_ACTIVE will deassert when TSM is idle</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFACT_EN</name>
              <description>S/W Enable of RF_ACTIVE pin</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RFACT_EN_0</name>
                  <description>Take no action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFACT_EN_1</name>
                  <description>Assert RF_ACTIVE pin</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFACT_WKUP_DLY</name>
              <description>RF_ACTIVE Wakeup Delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QREQ_SRC</name>
              <description>QUIET_REQ Source</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QREQ_SRC_0</name>
                  <description>QUIET_REQ is driven by the RFMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QREQ_SRC_1</name>
                  <description>QUIET_REQ is driven by the TSM/LL</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QREQ_SOC_EN</name>
              <description>QUIET_REQ Enable for SOC Core Flash</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QREQ_SOC_EN_0</name>
                  <description>QUIET_REQ is not enabled for SOC Core Flash</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QREQ_SOC_EN_1</name>
                  <description>QUIET_REQ is enabled for SOC Core Flash</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QREQ_RF_EN</name>
              <description>QUIET_REQ Enable for Radio CPU Flash</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QREQ_RF_EN_0</name>
                  <description>QUIET_REQ is not enabled for Radio CPU Flash</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QREQ_RF_EN_1</name>
                  <description>QUIET_REQ is enabled for Radio CPU Flash</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFNA_IBE</name>
              <description>RF_NOT_ALLOWED Input Buffer Enables</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RFNA_IBE_0</name>
                  <description>RF_NOT_ALLOWED input pin disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFNA_IBE_1</name>
                  <description>RF_NOT_ALLOWED input pin uses PTA16</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFNA_IBE_2</name>
                  <description>RF_NOT_ALLOWED input pin uses PTA17</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFNA_IBE_3</name>
                  <description>RF_NOT_ALLOWED input pin uses PTA22</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFNA_IBE_4</name>
                  <description>RF_NOT_ALLOWED input pin uses PTC7</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFNA_IBE_5</name>
                  <description>RF_NOT_ALLOWED input pin uses PTD6</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RF2p4GHz_TIMER</name>
          <description>2.4GHz TIMER Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIME</name>
              <description>Timer Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIM_CLR</name>
              <description>Timer Clear</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIM_CLR_0</name>
                  <description>Timer not cleared</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM_CLR_1</name>
                  <description>Timer cleared</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIM_EN</name>
              <description>Timer Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIM_EN_0</name>
                  <description>Timer disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM_EN_1</name>
                  <description>Timer enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RF2p4GHz_WOR1</name>
          <description>2.4GHz WOR Register 1</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DURATION_TGT</name>
              <description>WOR Low Power Duration Target</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENTER_REQ</name>
              <description>WOR Low Power Entry Request</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENTER_REQ_0</name>
                  <description>WOR low power mode request deasserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENTER_REQ_1</name>
                  <description>WOR low power mode request asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
